muazzamaqeel/BA-EmbeddedAI/STM32CubeIDE/STM32N6570-DK/Src/Core/AI/facerecognition_imp.c
// Facerecognition postprocess / FR thread
//
// Adds deep diagnostics to find accuracy regressions:
//  - Detects FR input quantization mismatch (U8 vs I8).
//  - Prints FR input stats (global + per-channel), ROI/crop/margin details,
//    and % of bilinear taps that were clamped to image borders.
//  - Prints FR output stats (int8 min/max/mean, dequant L2 norm, NaN check).
//  - Audits reference set at startup and prints Top-K matches per frame.
//  - Tracks embedding self-consistency over time.
//  - Uses per-channel crop normalization toward mid-gray for U8 paths.
//  - Optional gamma lift for dim crops.
//  - Hysteresis-based ID lock to avoid flicker.
//  - Option to flip FR input color order (BGR vs RGB).
//
// Build-time knobs (override with -D):
//   FR_INPUT_IS_U8=0/1      (0 = INT8 symmetric input; 1 = U8 zp=127 input)
//   FR_INPUT_IS_BGR=0/1     (swap R<->B for FR only; detector stays RGB)
//   FR_TOPK=3
//   FR_CROP_MARGIN=0.20f
//   FR_MATCH_THR=0.50f      (legacy single-threshold; used as THR_ON default)
//   FR_THR_ON=0.50f         (lock if candidate >= THR_ON)
//   FR_THR_OFF=0.40f        (keep lock while score >= THR_OFF)
//   FR_LOCK_FORGET_FRAMES=15
//   FR_PERIOD_MS=250
//   FR_ENABLE_BRIGHTEN=1
//   FR_BRIGHTEN_TARGET=0.50f      (≈127 in U8)
//   FR_BRIGHTEN_GAIN_MIN=0.80f
//   FR_BRIGHTEN_GAIN_MAX=1.50f
//   FR_ENABLE_GAMMA=1
//   FR_GAMMA=0.92f                (lift mids if dim)
//   FR_GAMMA_THRESH=0.45f         (apply gamma if meanRGB < thresh)
//

#include <stdio.h>
#include <string.h>
#include <stdint.h>
#include <stddef.h>
#include <math.h>
#include <assert.h>
#include "stm32n6xx_hal.h"
#include "FreeRTOS.h"
#include "semphr.h"
#include "app_config.h"
#include "network.h"
#include "cache_utils.h"
#include "npu_guard.h"
#include "ll_aton_runtime.h"
#include "app_shared.h"
#include "app_postprocess.h"
#include "fr_helpers.h"
#include "face_recognition.h"
#include "facerecognition_imp.h"
#include "app_ui_pin.h"
#include "app_ui_pin_face_rec.h"
#include "crypto_utils.h"
#include "refset_bin.h"
#include "app_change_pin.h"
#include "app_shared.h"
#include "profiler.h"

const LL_Buffer_InfoTypeDef *LL_ATON_Input_Buffers_Info_face_recognition(void);
const LL_Buffer_InfoTypeDef *LL_ATON_Output_Buffers_Info_face_recognition(void);

#ifndef MIN
#define MIN(a,b) (( (a) < (b) ) ? (a) : (b))
#endif

#ifndef FR_INPUT_IS_U8
#define FR_INPUT_IS_U8  FR_IN_IS_UINT8
#endif
#ifndef FR_INPUT_IS_BGR
#define FR_INPUT_IS_BGR 0
#endif

#ifndef FR_IN_INV_SCALE
#define FR_IN_INV_SCALE  128.0f
#endif
#ifndef FR_IN_ZP
#define FR_IN_ZP         127.0f
#endif

#ifndef FR_ENABLE_BRIGHTEN
#define FR_ENABLE_BRIGHTEN       1
#endif
#ifndef FR_BRIGHTEN_TARGET
#define FR_BRIGHTEN_TARGET       0.50f
#endif
#ifndef FR_BRIGHTEN_GAIN_MIN
#define FR_BRIGHTEN_GAIN_MIN     0.80f
#endif
#ifndef FR_BRIGHTEN_GAIN_MAX
#define FR_BRIGHTEN_GAIN_MAX     1.60f
#endif

#ifndef FR_ENABLE_GAMMA
#define FR_ENABLE_GAMMA          1
#endif
#ifndef FR_GAMMA
#define FR_GAMMA                 0.92f
#endif
#ifndef FR_GAMMA_THRESH
#define FR_GAMMA_THRESH          0.45f
#endif

#ifndef FR_TOPK
#define FR_TOPK  3
#endif

#ifndef FR_CROP_MARGIN
#define FR_CROP_MARGIN  0.20f
#endif

#ifndef FR_MATCH_THR
#define FR_MATCH_THR    0.65f
#endif
#ifndef FR_THR_ON
#define FR_THR_ON       0.65f
#endif
#ifndef FR_THR_OFF
#define FR_THR_OFF      0.60f
#endif
#ifndef FR_LOCK_FORGET_FRAMES
#define FR_LOCK_FORGET_FRAMES  15
#endif

#ifndef FR_PERIOD_MS
#define FR_PERIOD_MS    250U
#endif

#ifndef FR_ACCEPT_CONF_MIN
#define FR_ACCEPT_CONF_MIN   0.70f
#endif
#ifndef FR_ACCEPT_SIDE_MIN
#define FR_ACCEPT_SIDE_MIN   0.28f
#endif
#ifndef FR_CENTER_TOL
#define FR_CENTER_TOL        0.60f
#endif
#ifndef FR_SCORE_SIDE_REF
#define FR_SCORE_SIDE_REF    0.35f
#endif
#ifndef FR_STABLE_IOU_MIN
#define FR_STABLE_IOU_MIN    0.30f
#endif
#ifndef FR_HOLD_MISS_FRAMES
#define FR_HOLD_MISS_FRAMES  6
#endif
#ifndef FR_EMA_ALPHA
#define FR_EMA_ALPHA         0.70f
#endif

#ifndef DBG_EVERY_MS
#define DBG_EVERY_MS  2000U
#endif

#ifndef DBG_AUDIT_REFSET
#define DBG_AUDIT_REFSET  1
#endif

#ifndef DBG_PRINT_TOPK
#define DBG_PRINT_TOPK  1
#endif
#ifndef DBG_PRINT_IN_STATS
#define DBG_PRINT_IN_STATS  1
#endif
#ifndef DBG_PRINT_OUT_STATS
#define DBG_PRINT_OUT_STATS 1
#endif
#ifndef DBG_PRINT_ROI
#define DBG_PRINT_ROI  1
#endif

const LL_Buffer_InfoTypeDef *Detector_In_Info(void);
const LL_Buffer_InfoTypeDef *Detector_Out_Info(void);
void FaceRec_Run_NoLock(void);

extern bqueue_t nn_output_queue;
extern display_t disp;
extern volatile char g_fr_overlay_label[32];

typedef struct {
  char  name[32];
  float score;
  int   bad_frames;
  int   locked;
} id_lock_t;
static id_lock_t lock = {{0}, 0.0f, 0, 0};
extern char g_decrypted_pin[8];

typedef struct {
  od_pp_outBuffer_t roi;
  int   have;
  int   visible_count;
  int   missing_count;
  uint32_t last_seen_ms;
} primary_t;
static primary_t primary = {0};

const float     ACCEPT_CONF_MIN  = FR_ACCEPT_CONF_MIN;
const float     ACCEPT_SIDE_MIN  = FR_ACCEPT_SIDE_MIN;
const float     CENTER_TOL       = FR_CENTER_TOL;
const float     SCORE_SIDE_REF   = FR_SCORE_SIDE_REF;
const float     STABLE_IOU_MIN   = FR_STABLE_IOU_MIN;
const int       HOLD_MISS_FRAMES = FR_HOLD_MISS_FRAMES;
const float     EMA_ALPHA        = FR_EMA_ALPHA;

/* FR throttling & thresholds */
uint32_t last_fr_ms = 0;
const uint32_t FR_PERIOD = FR_PERIOD_MS;
const float    THR_ON    = FR_THR_ON;
const float    THR_OFF   = FR_THR_OFF;

uint32_t last_dbg_ms = 0;
float prev_emb[FR_EMB_SIZE]; int have_prev = 0;
static volatile bool g_pin_session_active = false;
static uint32_t      g_last_unlock_ms     = 0;
static int           g_stable_count       = 0;
static char          last_name[32]        = {0};

/* ---------------- helpers ---------------- */
static inline int clampi(int v, int lo, int hi){ return (v<lo)?lo:((v>hi)?hi:v); }
static inline float clampf(float v, float lo, float hi){ return (v<lo)?lo:((v>hi)?hi:v); }

void FR_ResetRecognitionState(void)
{
    printf("[FR][RESET] Clearing recognition and tracking state...\r\n");

    g_fr_overlay_label[0] = '\0';

    memset((void*)&primary, 0, sizeof(primary));
    memset((void*)&lock, 0, sizeof(lock));

    have_prev = 0;
    memset((void*)prev_emb, 0, sizeof(prev_emb));

    memset((void*)last_name, 0, sizeof(last_name));
    g_stable_count = 0;
    g_pin_session_active = false;

