muazzamaqeel/BA-EmbeddedAI/STM32CubeIDE/STM32N6570-DK/Src/Core/AI/facerecognition_imp.c
    printf("[FR][RESET] State cleared — ready for new face input.\r\n");
}

static float cosine_sim(const float *a, const float *b, int n)
{
  /* robust FP accumulation */
  double ab = 0.0, aa = 0.0, bb = 0.0;
  for (int i = 0; i < n; ++i) {
    double x = a[i], y = b[i];
    ab += x * y;  aa += x * x;  bb += y * y;
  }
  if (aa <= 0.0 || bb <= 0.0) return 0.0f;
  double d = ab / (sqrt(aa) * sqrt(bb));
  if (d >  1.0) d =  1.0;
  if (d < -1.0) d = -1.0;
  return (float)d;
}

static inline float iou_norm_boxes(const od_pp_outBuffer_t *a, const od_pp_outBuffer_t *b)
{
  float ax0 = a->x_center - a->width*0.5f,  ay0 = a->y_center - a->height*0.5f;
  float ax1 = a->x_center + a->width*0.5f,  ay1 = a->y_center + a->height*0.5f;
  float bx0 = b->x_center - b->width*0.5f,  by0 = b->y_center - b->height*0.5f;
  float bx1 = b->x_center + b->width*0.5f,  by1 = b->y_center + b->height*0.5f;
  float ix0 = fmaxf(ax0, bx0), iy0 = fmaxf(ay0, by0);
  float ix1 = fminf(ax1, bx1), iy1 = fminf(ay1, by1);
  float iw = fmaxf(0.f, ix1 - ix0), ih = fmaxf(0.f, iy1 - iy0);
  float inter = iw * ih;
  float aarea = fmaxf(0.f, ax1-ax0) * fmaxf(0.f, ay1-ay0);
  float barea = fmaxf(0.f, bx1-bx0) * fmaxf(0.f, by1-by0);
  float uni = aarea + barea - inter + 1e-6f;
  return inter / uni;
}

typedef struct {
  float x0, y0, x1, y1;
  float side, roi_w, roi_h;
  int   taps, taps_clamped;
  float mean_r, mean_g, mean_b;
} CropDbg;

static inline void bilinear_rgb_sample(
    const float *src_nhwc, int src_w, int src_h,
    float fx, float fy,
    float *r, float *g, float *b,
    int *hit_border)
{
  int sx0 = (int)floorf(fx);
  int sy0 = (int)floorf(fy);
  int sx1 = sx0 + 1;
  int sy1 = sy0 + 1;

  int csx0 = sx0, csx1 = sx1, csy0 = sy0, csy1 = sy1;
  if (csx0 < 0) csx0 = 0; else if (csx0 >= src_w) csx0 = src_w - 1;
  if (csx1 < 0) csx1 = 0; else if (csx1 >= src_w) csx1 = src_w - 1;
  if (csy0 < 0) csy0 = 0; else if (csy0 >= src_h) csy0 = src_h - 1;
  if (csy1 < 0) csy1 = 0; else if (csy1 >= src_h) csy1 = src_h - 1;

  float wx = fx - (float)sx0;
  float wy = fy - (float)sy0;

  const int idx00 = (csy0 * src_w + csx0) * 3;
  const int idx01 = (csy0 * src_w + csx1) * 3;
  const int idx10 = (csy1 * src_w + csx0) * 3;
  const int idx11 = (csy1 * src_w + csx1) * 3;

  const float w00 = (1.0f - wx) * (1.0f - wy);
  const float w01 = (       wx) * (1.0f - wy);
  const float w10 = (1.0f - wx) * (       wy);
  const float w11 = (       wx) * (       wy);

  *r = src_nhwc[idx00+0]*w00 + src_nhwc[idx01+0]*w01 +
       src_nhwc[idx10+0]*w10 + src_nhwc[idx11+0]*w11;
  *g = src_nhwc[idx00+1]*w00 + src_nhwc[idx01+1]*w01 +
       src_nhwc[idx10+1]*w10 + src_nhwc[idx11+1]*w11;
  *b = src_nhwc[idx00+2]*w00 + src_nhwc[idx01+2]*w01 +
       src_nhwc[idx10+2]*w10 + src_nhwc[idx11+2]*w11;

  if (hit_border) {
    int clamped = (csx0 != sx0) || (csx1 != sx1) || (csy0 != sy0) || (csy1 != sy1);
    *hit_border = clamped;
  }
}

/* Crop detector float32 frame (RGB, NHWC, [0..1]) using ROI
 * → FaceRec 160×160 quantized input (INT8 sym or U8 asym), with margin.
 * Matches TFLite U8 input quantization: scale=1/128, zp=127 when FR_INPUT_IS_U8=1.
 * Optional per-channel brightness normalization and gamma lift.
 */
static void crop_to_facerec_input_quant_from_detector_f32(
    const float *src_nhwc,  int src_w, int src_h,
    const od_pp_outBuffer_t *roi,
    float margin,
#if FR_INPUT_IS_U8
    uint8_t *dst,
#else
    int8_t  *dst,
#endif
    int dst_w, int dst_h,
    CropDbg *dbg /* optional */)
{
  /* square crop with configurable margin */
  const float cx = roi->x_center * (float)src_w;
  const float cy = roi->y_center * (float)src_h;
  const float bw = roi->width  * (float)src_w;
  const float bh = roi->height * (float)src_h;
  const float side0 = fmaxf(bw, bh);
  const float side  = side0 * (1.0f + margin);
  const float x0 = cx - side * 0.5f;
  const float y0 = cy - side * 0.5f;
  const float x1 = cx + side * 0.5f;
  const float y1 = cy + side * 0.5f;

  const float sx_scale = (x1 - x0) / (float)dst_w;
  const float sy_scale = (y1 - y0) / (float)dst_h;

  int taps = 0, clamped = 0;
  double acc_r = 0.0, acc_g = 0.0, acc_b = 0.0;

  float gain_r = 1.0f, gain_g = 1.0f, gain_b = 1.0f;
  float apply_gamma = 0.0f;

#if FR_ENABLE_BRIGHTEN
  /* ----- Pass 1: estimate per-channel brightness in the crop ----- */
  for (int y = 0; y < dst_h; ++y) {
    float sy = y0 + (y + 0.5f) * sy_scale;
    for (int x = 0; x < dst_w; ++x) {
      float sx = x0 + (x + 0.5f) * sx_scale;
      float r,g,b; int hit=0;
      bilinear_rgb_sample(src_nhwc, src_w, src_h, sx, sy, &r, &g, &b, &hit);
      acc_r += r; acc_g += g; acc_b += b;
      taps++; if (hit) clamped++;
    }
  }
  double denom = (double)(dst_w * dst_h);
  float mean_r = (float)(acc_r / denom);
  float mean_g = (float)(acc_g / denom);
  float mean_b = (float)(acc_b / denom);
  float mean_rgb = (mean_r + mean_g + mean_b) * (1.0f/3.0f);

  /* Per-channel gains toward target */
  if (mean_r > 1e-6f) gain_r = clampf(FR_BRIGHTEN_TARGET / mean_r, FR_BRIGHTEN_GAIN_MIN, FR_BRIGHTEN_GAIN_MAX);
  if (mean_g > 1e-6f) gain_g = clampf(FR_BRIGHTEN_TARGET / mean_g, FR_BRIGHTEN_GAIN_MIN, FR_BRIGHTEN_GAIN_MAX);
  if (mean_b > 1e-6f) gain_b = clampf(FR_BRIGHTEN_TARGET / mean_b, FR_BRIGHTEN_GAIN_MIN, FR_BRIGHTEN_GAIN_MAX);

#if FR_ENABLE_GAMMA
  if (mean_rgb < FR_GAMMA_THRESH) apply_gamma = FR_GAMMA;
#endif

  if (dbg) { acc_r = acc_g = acc_b = 0.0; taps = 0; clamped = 0; }
#endif /* FR_ENABLE_BRIGHTEN */

  /* ----- Pass 2: apply gains/gamma (if enabled), map, quantize ----- */
  for (int y = 0; y < dst_h; ++y) {
    float sy = y0 + (y + 0.5f) * sy_scale;
    for (int x = 0; x < dst_w; ++x) {
      float sx = x0 + (x + 0.5f) * sx_scale;
      float r,g,b; int hit=0;
      bilinear_rgb_sample(src_nhwc, src_w, src_h, sx, sy, &r, &g, &b, &hit);

#if FR_ENABLE_BRIGHTEN
      r = clampf(r*gain_r, 0.0f, 1.0f);
      g = clampf(g*gain_g, 0.0f, 1.0f);
      b = clampf(b*gain_b, 0.0f, 1.0f);
  #if FR_ENABLE_GAMMA
      if (apply_gamma > 0.0f && apply_gamma != 1.0f) {
        r = powf(r, apply_gamma);
        g = powf(g, apply_gamma);
        b = powf(b, apply_gamma);
      }
  #endif
#endif

      if (dbg) { acc_r += r; acc_g += g; acc_b += b; taps++; if (hit) clamped++; }

#if FR_INPUT_IS_BGR
      float tmp = r; r = b; b = tmp;
#endif

      /* map [0..1] → [-1,1] */
      float rq = r * 2.0f - 1.0f;
      float gq = g * 2.0f - 1.0f;
      float bq = b * 2.0f - 1.0f;

