muazzamaqeel/BA-EmbeddedAI/STM32CubeIDE/STM32N6570-DK/Src/Core/AI/facerecognition_imp.c
      const int d = (y * dst_w + x) * 3;
#if FR_INPUT_IS_U8
      int qr = (int)lrintf(rq * FR_IN_INV_SCALE + FR_IN_ZP);
      int qg = (int)lrintf(gq * FR_IN_INV_SCALE + FR_IN_ZP);
      int qb = (int)lrintf(bq * FR_IN_INV_SCALE + FR_IN_ZP);
      if (qr < 0)   qr = 0;   else if (qr > 255) qr = 255;
      if (qg < 0)   qg = 0;   else if (qg > 255) qg = 255;
      if (qb < 0)   qb = 0;   else if (qb > 255) qb = 255;
      ((uint8_t*)dst)[d+0] = (uint8_t)qr;
      ((uint8_t*)dst)[d+1] = (uint8_t)qg;
      ((uint8_t*)dst)[d+2] = (uint8_t)qb;
#else
      int qr = (int)lrintf(rq * 127.0f);
      int qg = (int)lrintf(gq * 127.0f);
      int qb = (int)lrintf(bq * 127.0f);
      if (qr < -128) qr = -128; else if (qr > 127) qr = 127;
      if (qg < -128) qg = -128; else if (qg > 127) qg = 127;
      if (qb < -128) qb = -128; else if (qb > 127) qb = 127;
      ((int8_t*)dst)[d+0] = (int8_t)qr;
      ((int8_t*)dst)[d+1] = (int8_t)qg;
      ((int8_t*)dst)[d+2] = (int8_t)qb;
#endif
    }
  }

  if (dbg) {
    dbg->x0 = x0; dbg->y0 = y0; dbg->x1 = x1; dbg->y1 = y1;
    dbg->side = side; dbg->roi_w = bw; dbg->roi_h = bh;
    dbg->taps = taps; dbg->taps_clamped = clamped;
    double denom2 = (double)(dst_w * dst_h);
    dbg->mean_r = (float)(acc_r / denom2);
    dbg->mean_g = (float)(acc_g / denom2);
    dbg->mean_b = (float)(acc_b / denom2);
  }
}
static float l2_norm(const float *x, int n)
{
  double s=0.0; for (int i=0;i<n;i++){ double v=x[i]; s+=v*v; }
  return (float)sqrt(s);
}
void pp_thread_fct(void *arg)
{
#if POSTPROCESS_TYPE == POSTPROCESS_OD_YOLO_V2_UF
  yolov2_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_OD_YOLO_V5_UU
  yolov5_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_OD_YOLO_V8_UF || POSTPROCESS_TYPE == POSTPROCESS_OD_YOLO_V8_UI
  yolov8_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_CUSTOM
#else
# error "PostProcessing type not supported"
#endif

  const LL_Buffer_InfoTypeDef *nn_out_info = Detector_Out_Info();
  {
    for (int i = 0; i < NN_OUT_NB; ++i) {
      const char *nm = nn_out_info[i].name ? nn_out_info[i].name : "(null)";
      unsigned long blen = (unsigned long)LL_Buffer_len(&nn_out_info[i]);
      printf("[NN] out[%d] %-24s len=%lu bytes (%lu floats)\r\n",
             i, nm, blen, blen / (unsigned long)sizeof(float));
    }
  }


  printf("[FR] Waiting for reference set from SD task...\r\n");
  while (g_refset_ready == 0) {
      vTaskDelay(pdMS_TO_TICKS(100));
  }

  if (g_refset_ready < 0 || g_ref_set_count <= 0) {
      printf("[FR][ERR] Reference set not available (g_refset_ready=%d, count=%d)\r\n",
             g_refset_ready, g_ref_set_count);
  }
  printf("[FR] Encrypted reference sets ready: %d\r\n", g_ref_set_count);
  if (g_ref_set_count > 0) {
      printf("[FR][DBG] First entry: %s, dim=%d, first bytes: ",
             g_ref_set[0].name, g_ref_set[0].dim);
      for (int i = 0; i < 8 && i < g_ref_set[0].dim; ++i)
          printf("%.4f ", g_ref_set[0].data[i]);
      printf("\r\n");
  }


  void *pp_input[NN_OUT_NB];
  uint32_t pp_len[NN_OUT_NB];
  od_pp_out_t pp_output;
  uint32_t nn_pp[2];
  int ret;

#if POSTPROCESS_TYPE == POSTPROCESS_CUSTOM
  app_postprocess_init(NULL);
#else
  app_postprocess_init(&pp_params);
#endif

  /* -------- FaceRec I/O discovery (INT8 pipeline) -------- */
  const LL_Buffer_InfoTypeDef *fr_in_info  = LL_ATON_Input_Buffers_Info_face_recognition();
  const LL_Buffer_InfoTypeDef *fr_out_info = LL_ATON_Output_Buffers_Info_face_recognition();

#if FR_INPUT_IS_U8
  uint8_t *fr_in = (uint8_t *)LL_Buffer_addr_start(&fr_in_info[0]);    /* U8 input */
  const char *mode_str = "U8(zp=127)";
#else
  int8_t  *fr_in = (int8_t  *)LL_Buffer_addr_start(&fr_in_info[0]);    /* I8 input */
  const char *mode_str = "I8(zp=0)";
#endif
  int8_t  *fr_out       = (int8_t  *)LL_Buffer_addr_start(&fr_out_info[0]); /* I8 output */
  uint32_t fr_in_len    = LL_Buffer_len(&fr_in_info[0]);
  uint32_t fr_out_len   = LL_Buffer_len(&fr_out_info[0]);

  const uint32_t need_in_bytes = (uint32_t)(FR_IN_W * FR_IN_H * 3);  /* e.g., 160*160*3 = 76800 */

  if (!fr_in || !fr_out || fr_in_len < need_in_bytes || fr_out_len < FR_EMB_SIZE) {
    printf("[FR][ERR] IO invalid: in=%p (%lu) out=%p (%lu) need_in=%lu need_out=%u\r\n",
           (void*)fr_in, (unsigned long)fr_in_len,
           (void*)fr_out, (unsigned long)fr_out_len,
           (unsigned long)need_in_bytes, (unsigned)FR_EMB_SIZE);
  } else {
    printf("[FR][IO] IN=%p (%lu) OUT=%p (%lu)  (expected in=%lu out=%u)  [mode=%s]%s\r\n",
           (void*)fr_in, (unsigned long)fr_in_len,
           (void*)fr_out, (unsigned long)fr_out_len,
           (unsigned long)need_in_bytes, (unsigned)FR_EMB_SIZE, mode_str,
           FR_INPUT_IS_BGR ? " [FR uses BGR]" : "");
  }

  /* Audit reference set once */
#if DBG_AUDIT_REFSET
  {
    printf("[REFSET] entries=%d\r\n", g_ref_set_count);
    int bad=0;
    for (int i=0;i<g_ref_set_count;i++){
      float n = l2_norm(g_ref_set[i].data, g_ref_set[i].dim);
      printf("  - #%d name=%s dim=%d L2=%.3f\r\n", i,
             (g_ref_set[i].name?g_ref_set[i].name:"?"),
             g_ref_set[i].dim, n);
      if (!(n>0.0f && isfinite(n))) bad++;
    }
    if (bad) printf("[REFSET][WARN] %d invalid L2 norms (zero/NaN/Inf)\r\n", bad);
  }
#endif


  while (1)
  {
    (void)bqueue_get_ready(&nn_output_queue);

    /* Map & invalidate NPU outputs for CPU read */
    for (int i = 0; i < NN_OUT_NB; i++) {
      pp_input[i] = LL_Buffer_addr_start(&nn_out_info[i]);
      pp_len[i]   = LL_Buffer_len(&nn_out_info[i]);
      DCACHE_Invalidate(pp_input[i], pp_len[i]);
    }

    /* Run detection postprocess */
    pp_output.pOutBuff  = NULL;
    pp_output.nb_detect = 0;
    nn_pp[0] = HAL_GetTick();
#if POSTPROCESS_TYPE == POSTPROCESS_CUSTOM
    ret = app_postprocess_run((void **)pp_input, NN_OUT_NB, &pp_output, NULL);
#else
    ret = app_postprocess_run((void **)pp_input, NN_OUT_NB, &pp_output, &pp_params);
#endif
    assert(ret == 0);
    nn_pp[1] = HAL_GetTick();

